wait_tick:
        ;------------------------------------
        ; スタックフレームの構築
        ;------------------------------------
                                                ;-----------
                                                ; EBP + 8 | ウェイト
                                                ;-----------
        push EBP                                ; EBP + 4 | EIP(戻り番地)
        mov ebp, esp                            ; EBP + 0 | EBP(元の値)
                                                ;---------|----------

        ;-----------------------------------
        ; レジスタの保存
        ;-----------------------------------
        push eax
        push ecx

        ;-----------------------------------
        ; ウェイト
        ;-----------------------------------
        mov ecx, [ebp + 8]                      ; ECX = ウェイト回数
        mov eax, [TIMER_COUNT]                  ; EAX = TIMER;
                                                ; do
                                                ; {
.10L:   cmp [TIMER_COUNT], eax                  ;   while(TIMER != EAX)
        je .10L
        inc eax                                 ;       EAX++;
        loop .10L                               ; } while (--ECX);

        ;-----------------------------------
        ; レジスタの復帰
        ;-----------------------------------
        pop ecx
        pop eax

        ;-----------------------------------
        ; スタックフレーム
        ;-----------------------------------
        mov esp, ebp
        pop ebp

        ret